I-SYST/EHAL/ARM/ST/STM32L4xx/include/stm32l4xxxxx.h
#endif /* STM32L471xx || STM32L475xx || STM32L476xx || STM32L485xx || STM32L486xx || STM32L496xx || STM32L4A6xx || STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
#if defined (STM32L431xx) || defined (STM32L432xx) || defined (STM32L433xx) || defined (STM32L442xx) || defined (STM32L443xx) || defined (STM32L471xx) || defined (STM32L475xx) || defined (STM32L476xx) || defined (STM32L485xx) || defined (STM32L486xx) || defined (STM32L496xx) || defined (STM32L4A6xx)
  SWPMI1_IRQn                 = 76,     /*!< Serial Wire Interface 1 global interrupt                          */
#endif /* STM32L431xx || STM32L432xx || STM32L433xx || STM32L442xx || STM32L443xx || STM32L471xx || STM32L475xx || STM32L476xx || STM32L485xx || STM32L486xx || STM32L496xx || STM32L4A6xx */
#if defined (STM32L4R5xx) || defined (STM32L4R7xx) || defined (STM32L4R9xx) || defined (STM32L4S5xx) || defined (STM32L4S7xx) || defined (STM32L4S9xx)
  OCTOSPI2_IRQn               = 76,     /*!< OctoSPI2 global interrupt                                         */
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
  TSC_IRQn                    = 77,     /*!< Touch Sense Controller global interrupt                           */
#if defined (STM32L433xx) || defined (STM32L443xx) || defined (STM32L476xx) || defined (STM32L486xx) || defined (STM32L496xx) || defined (STM32L4A6xx)
  LCD_IRQn                    = 78,     /*!< LCD global interrupt                                              */
#endif /* STM32L433xx || STM32L443xx || STM32L476xx || STM32L486xx || STM32L496xx || STM32L4A6xx */
#if defined (STM32L4R9xx) || defined (STM32L4S9xx)
  DSI_IRQn                    = 78,     /*!< DSI global Interrupt                                              */
#endif /* STM32L4R9xx || STM32L4S9xx */
#if defined (STM32L442xx) || defined (STM32L443xx) || defined (STM32L462xx) || defined (STM32L485xx) || defined (STM32L486xx) || defined (STM32L4A6xx) || defined (STM32L4S5xx) || defined (STM32L4S7xx) || defined (STM32L4S9xx)
  AES_IRQn                    = 79,     /*!< AES global interrupt                                              */
#endif /* STM32L442xx || STM32L443xx || STM32L462xx || STM32L485xx || STM32L486xx || STM32L4A6xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
#if defined (STM32L4A6xx)
  HASH_RNG_IRQn               = 80,     /*!< HASH and RNG global interrupt                                     */
#else
  RNG_IRQn                    = 80,     /*!< RNG global interrupt                                              */
#endif /* STM32L4A6xx */
#if defined (STM32L471xx) || defined (STM32L475xx) || defined (STM32L476xx) || defined (STM32L485xx) || defined (STM32L486xx)
  FPU_IRQn                    = 81      /*!< FPU global interrupt                                              */
#endif /* STM32L471xx || STM32L475xx || STM32L476xx || STM32L485xx || STM32L486xx  */
#if defined (STM32L431xx) || defined (STM32L432xx) || defined (STM32L433xx) || defined (STM32L442xx) || defined (STM32L443xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
  CRS_IRQn                    = 82      /*!< CRS global interrupt                                              */
#endif /* STM32L431xx || STM32L432xx || STM32L442xx || STM32L433xx || STM32L443xx */
#if defined (STM32L451xx) || defined (STM32L452xx) || defined (STM32L462xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
  CRS_IRQn                    = 82,     /*!< CRS global interrupt                                              */
  I2C4_EV_IRQn                = 83,     /*!< I2C4 Event interrupt                                              */
  I2C4_ER_IRQn                = 84      /*!< I2C4 Error interrupt                                              */
#endif /* STM32L451xx || STM32L452xx || STM32L462xx */
#if defined (STM32L496xx) || defined (STM32L4A6xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
  CRS_IRQn                    = 82,     /*!< CRS global interrupt                                              */
  I2C4_EV_IRQn                = 83,     /*!< I2C4 Event interrupt                                              */
  I2C4_ER_IRQn                = 84,     /*!< I2C4 Error interrupt                                              */
  DCMI_IRQn                   = 85,     /*!< DCMI global interrupt                                             */
  CAN2_TX_IRQn                = 86,     /*!< CAN2 TX interrupt                                                 */
  CAN2_RX0_IRQn               = 87,     /*!< CAN2 RX0 interrupt                                                */
  CAN2_RX1_IRQn               = 88,     /*!< CAN2 RX1 interrupt                                                */
  CAN2_SCE_IRQn               = 89,     /*!< CAN2 SCE interrupt                                                */
  DMA2D_IRQn                  = 90      /*!< DMA2D global interrupt                                            */
#endif /* STM32L496xx || STM32L4A6xx */
#if defined (STM32L4R5xx) || defined (STM32L4R7xx) || defined (STM32L4R9xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
  CRS_IRQn                    = 82,     /*!< CRS global interrupt                                              */
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx */
#if defined (STM32L4S5xx) || defined (STM32L4S7xx) || defined (STM32L4S9xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
  HASH_CRS_IRQn               = 82,     /*!< HASH and CRS interrupt                                            */
#endif /* STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
#if defined (STM32L4R5xx) || defined (STM32L4R7xx) || defined (STM32L4R9xx) || defined (STM32L4S5xx) || defined (STM32L4S7xx) || defined (STM32L4S9xx)
  I2C4_EV_IRQn                = 83,     /*!< I2C4 Event interrupt                                              */
  I2C4_ER_IRQn                = 84,     /*!< I2C4 Error interrupt                                              */
  DCMI_IRQn                   = 85,     /*!< DCMI global interrupt                                             */
  DMA2D_IRQn                  = 90,     /*!< DMA2D global interrupt                                            */
#if defined (STM32L4R7xx) || defined (STM32L4R9xx) || defined (STM32L4S7xx) || defined (STM32L4S9xx)
  LTDC_IRQn                   = 91,     /*!< LTDC global Interrupt                                             */
  LTDC_ER_IRQn                = 92,     /*!< LTDC Error global Interrupt                                       */
  GFXMMU_IRQn                 = 93,     /*!< GFXMMU global error interrupt                                     */
#endif /* STM32L4R7xx || STM32L4R9xx || STM32L4S7xx || STM32L4S9xx */
  DMAMUX1_OVR_IRQn            = 94      /*!< DMAMUX1 overrun global interrupt                                  */
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */
} IRQn_Type;

/**
  * @}
  */

